# Завдання 3.2
# Перемістити елемент у списку
#Програма має перенести останній елемент списку з кінця на початок, 
#тобто, останній елемент списку має стати першим. 
#Послідовність інших елементів не має змінюватися.
#Порожній список або список з одним елементом повинен залишитися незмінним.
#Кількість елементів у списку може бути будь-яким – нуль та більше!

nums = [12, 3, 4, 10]
nums.insert(0, nums.pop())
print(nums)

nums = [1]
nums.insert(0, nums.pop())
print(nums)

nums = []
if nums:
   nums.insert(0, nums.pop())
print(nums)

nums = [12, 3, 4, 10, 8]
nums.insert(0, nums.pop())
print(nums)
