import math

print('------------------Завдання 1.----------------------- ')
number =int(input('введіть число'))
# вводимо число
square = number ** 2
# виводимо квадрат числа
print('Квадрат числа дорівнює :', square)
# виводимо на екран результат обчислення


# 2. "Середньє трьох чисел"
# Програма запитує три числа і виводить іх середнє арифметичне

# Вводимо три числа
print('------------------Завдання 2.--------------------')

a = int(input('Ведіть перше число : '))
b = int(input('Введіть друге число : '))
c = int(input('Введіть третє число : '))

# Знаходимо середнє арифметичне
average = (a + b + c)/ 3

# Виводимо результат на екран
print ('Середнє арифметичне дорівнює :' , average)

# 3. "Перетворення хвилин у години"
# Користувач вводить кількість хвилин.
# Програма виводить скільки це годин і хвилин.

# Вводимо кількість хвилин
print('------------Завдання 3.--------------')
minutes = int(input('Введіть кількість хвилин :'))
# Розраховуємо кількість годин та залишок хвилин
hours = minutes // 60
minutes_left = minutes % 60
# Виводимо на екран результат
print(' Результат , ', hours , 'години(годин)', minutes_left ,'хвилин')

# 4. " Користувач вводить ціну товару і розмір знижки у %
# Програма виводить кінцеву ціну

# Вводимо ціну товару та розмір знижки у відсотках %
print('-------------Завдання 4.------------ ')
price = int(input('Введіть ціну товару : '))
# вводимо розмір знижки на товар
discount = int(input('Введіть розмір знижки % :  '))
# розраховуємо кінцеву ціну товару
end_price = price - (price * discount / 100)
#виводимо результат на екран
print('кінцева ціна : ' , end_price)

# 5. " Остання цифра числа"
#Користувач вводить ціле число. Програма виводить його останнє число.
print('--------------Завдання 5.-----------------')
#Вводимо ціле число
number = int(input('Введіть ціле число : '))
# Знаходимо останнє число через кратне від ділення
last_number = number % 10
#Виводимо результат
print("Останнє число :  ", last_number)


# Завдання 6. " Периметр трикутника"
# Користувач вводить ширину та довжину. Програма виводить периметр.

print('--------------Завдання 6.------------------')
# Вводимо довжину та ширину
a = int(input('Введіть довжину: '))
b = int(input('Введіть ширину: '))
# Знаходимо третю сторону
c = a + b
# Знаходимо периметр трикутника
perimetr = a + b + c
# Виводимо результат на екран
print('Периметр трикутника дорівнює :  ', perimetr)

# Завдання 7.
#Виведення числа в стовпчик. Написати програму, яка просить користувача ввести 4-х значне число з клавіатури,
# після чого друкує на екрані стовпчик цифр, з якого це число складається.

# Вводимо число
print('---------------Завдання 7.--------------')
number = int(input('Введіть 4-х значне число: '))
# Переводимо число в стовпчик
d1 = number // 1000
d2 = (number // 100) % 10
d3 = (number // 10)% 10
d4 = number % 10

# Виводимо результат на екран
print(d1)
print(d2)
print(d3)
print(d4)

