# Завдання 3.1
# Програма має виконувати прості дії( +,-,*, /).
# Користувачеві пропонується по черзі ввести числа та дію
#над цими числами,а програма, виходячи з дії, обчислює та друкує результат
# Зробити перевірку на те, що при діленні дільник не дорівнює 0!


# Робимо меню

while True:
    print('\n-----Калькулятор-----')
    print('1. Додавання')
    print('2. Віднімання')
    print('3. Множення')
    print('4. Ділення')
    print('0. Вихід')
    menu = input('Оберіть пункт меню:')
    if menu == '0':
       print('Дякую, на все добре! Програму закінчено!')
       break
    if menu  not in ('1','2','3','4'):
        print('Невірний пункт меню!!!')
        continue
    a = int(input('Введіть перше число:'))
    b = int(input('Введіть друге число:'))
    if menu == '1':
        print('Результат', a + b)
    elif menu == '2':
        print('Результат:', a - b)
    elif menu == '3':
        print('Результат:', a * b)
    elif menu == '4':
        if b or a  == 0:
            print('Помилка ділення на Нуль!')
        else:
            print('Результат:', a / b)
